tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "slp/krunkit"
tap "xnoto/opencode-agent-hub"
brew "age"
brew "awscli"
brew "checkov"
brew "chezmoi"
brew "coreutils"
brew "gh"
brew "gnupg"
brew "go"
brew "htop"
brew "kubernetes-cli"
brew "kubeseal"
brew "macvim"
brew "mongocli"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "odo-dev"
brew "opencode"
brew "openshift-cli"
brew "opentofu"
brew "openvpn"
brew "pandoc"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "postgresql@18"
brew "pre-commit"
brew "sops"
brew "tailscale"
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "tmux"
brew "trivy"
brew "uv"
brew "vivid"
brew "yamllint"
brew "yq"
brew "oven-sh/bun/bun"
brew "slp/krunkit/krunkit"
brew "xnoto/opencode-agent-hub/opencode-agent-hub"
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "basictex"
cask "bitwarden"
cask "claude-code"
cask "crossover"
cask "cursor"
cask "discord"
cask "displaylink"
cask "firefox"
cask "gcloud-cli"
cask "gimp"
cask "google-chrome"
cask "libreoffice"
cask "linear-linear"
cask "megasync"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "notion"
cask "paintbrush"
cask "podman-desktop"
cask "slack"
cask "spotify"
cask "steam"
cask "tailscale-app"
cask "thunderbird"
cask "yubico-authenticator"
