tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "slp/krunkit"
tap "xnoto/opencode-agent-hub"
brew "age"
brew "awscli"
brew "chezmoi"
brew "gh"
brew "gnupg"
brew "go"
brew "htop"
brew "kubernetes-cli"
brew "mongosh"
brew "odo-dev"
brew "opencode"
brew "openshift-cli"
brew "podman"
brew "podman-compose"
brew "pre-commit"
brew "sops"
brew "tmux"
brew "uv"
brew "vim"
brew "oven-sh/bun/bun"
brew "slp/krunkit/krunkit"
brew "xnoto/opencode-agent-hub/opencode-agent-hub"
cask "1password"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "bitwarden"
cask "claude-code"
cask "crossover"
cask "cursor"
cask "discord"
cask "displaylink"
cask "gcloud-cli"
cask "gimp"
cask "google-chrome"
cask "linear-linear"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "notion"
cask "paintbrush"
cask "podman-desktop"
cask "slack"
cask "steam"
cask "thunderbird"
cask "yubico-authenticator"
go "github.com/niwoerner/go-agentskills/cmd/go-agentskills"
