tap "argoproj/tap"
tap "cormacrelf/tap"
tap "eugene1g/safehouse"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "slp/krunkit", trusted: true
tap "xnoto/opencode-agent-hub"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Simple, modern, secure file encryption
brew "age"
# Command-line interface for SQLite
brew "sqlite"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Official Amazon AWS command-line interface
brew "awscli"
# CLI to facilitate terraforming your existing Cloudflare resources
brew "cf-terraforming"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Device tree compiler
brew "dtc"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Quickly clone an entire org's or user's repositories into one directory
brew "ghorg"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# CLI agent for MoonshotAI Kimi platform
brew "kimi-cli"
# Run local Kubernetes cluster in Docker
brew "kind"
# Flexible Kustomize Plugin for SOPS Encrypted Resources
brew "ksops"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Library for handling OpenGL function pointer management
brew "libepoxy"
# Next-gen compiler infrastructure
brew "llvm"
# GUI for vim, made for macOS
brew "macvim"
# Implementation of the Vulkan graphics and compute API on top of Metal
brew "molten-vk"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Developer-focused CLI for Kubernetes and OpenShift
brew "odo-dev"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# OpenShift command-line interface tools
brew "openshift-cli"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@18"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Password generator
brew "pwgen"
# Simple powerful testing with Python
brew "pytest"
# Extremely fast Python linter, written in Rust
brew "ruff"
# SMB/CIFS file, print, and login server for UNIX
brew "samba"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Source-code syntax highlighter
brew "source-highlight"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Detect compliance and security violations across Infrastructure as Code
brew "terrascan"
# Linter for Terraform files
brew "tflint"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# A CLI tool to start Linux KVM or macOS Hypervisor framework virtual machines using the libkrun platform.
brew "slp/krunkit/krunkit"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Desktop password and login vault
cask "bitwarden"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Tool to run Windows software
cask "crossover"
# Voice and text chat software
cask "discord"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# Web browser
cask "firefox"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# App to manage software development and track bugs
cask "linear"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Digital note taking app
cask "microsoft-onenote"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# App to write, plan, collaborate, and get organised
cask "notion"
# Image editor
cask "paintbrush"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Customizable email client
cask "thunderbird"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Full-featured companion app to the YubiKey
cask "yubico-authenticator"
# Video communication and virtual meeting platform
cask "zoom"
go "github.com/niwoerner/go-agentskills/cmd/go-agentskills"
npm "better-sqlite3"
npm "context-mode"
npm "mmx-cli"
npm "opencode-docs-mcp"
